# -*- coding:utf-8 -*-
# author: hoster
# -------------------------------------------------------------------------------

ZBR = [r"供应商",r"中标单位", r"第一候选人", r"第一名", r"第一中标候选人", r"第一中标排序人", r"第一中标排序人为", r"排名第一", r"第一中标入围单位",
       r"第一成交候选人", r"第一中标排序单位名称", r"第一中标排序单位", r"第一包", r"第一推荐中标候选人为", r"排名第一",
       r"第一排序人", r"中标人名称", r"中标人为", r"中标人", r"中 标 人",  r"预中标单位", r"中标单位单位名称", r"中标单位名称",
       r"中标单位为",  r"中 标 单 位", r"中标候选单位", r"预中标候选人及中标价", r"中标候选人推荐为", r"中标候选人名称",
       r"中标候选人为", r"中标候选人", r"成交供应商", r"中标候选供应商名称", r"中标供应商名称", r"中标企业为",  r"中标供应商名单",
       r" 中标供应商为", r"中标供应商", r"预中标（成交）人名称", r"预中标（成交）人", r"中标（成交）单位为",
       r"中标侯选人", r"成交单位名称", r"预成交人名称",  r"成交人", r"成交供应商名称", r"供应商名称"
       r"成交单位",  r"中标入围单位", r"候选人名称", r"成交候选人",  r"中选单位",  r"中标结果", r"单位名称", r'供应商：']

ZBJ = [r"成交价格", r"中标价(元)", r"中标价格为", r'中标价格', r"预中标价：", r"中标价", r"中 标 价", r'中 标价', r"预中标金额",
       r'中标金额为', r"中标金额",  r"成交价：", r"中标成交金额", r"成交金额：",   r"预中标（成交）金额",
       r"金额为", r"中标总价为", r" 中标（成交）金额", r'价格（元）', r"报价", r"金额：", r"投标报价",  r"投标价", r"投标报价（元）", r'中标总价：', r'成交金额   （万元） ']

ZSH = [r"资质证书编号", r"证书号", r"证书编号", r"注册证号", r"注册编号", r"证号"]

FER = [r"项目负责人", r"项目经理", r"建造师", r"建造师名称", r"项目负责人/证书号", r'项目经理/总监',
       r"项目负责人姓名", r"建筑师/总监/负责人", r"建造师姓名", r"注册建造师",  r"注册建造师", r"项目负责人及建造师证号",
       r"注册建造师(项目经理)", r"总监理工程师", r"项目经理", r'总施工工程师', '总监理工程师及资质', r'项目总监']

DATE = [r"发布时间", r"发布日期", r"公示时间"]

Noise = [u'候选人', u'通知书', u'阳光', u"）", u')', u'通达', u'帝威', u'康立', u'帝宇', u'文明', u'盖章', u'广福镇', u'明粤', u'龙晟', u'贝林', u'华辉']
